/*
**********************************************************************
*                         头文件包含
**********************************************************************
*/
#include "keyScan.h"


/*
**********************************************************************
*                         本地宏定义
**********************************************************************
*/


/*
**********************************************************************
*                         本地全局变量
**********************************************************************
*/
sbit key1 = P3^0;		//独立按键s2
sbit key2 = P3^1;		//独立按键s3
sbit key3 = P3^2;		//独立按键s4
sbit key4 = P3^3;		//独立按键s5

sbit hot1 = P1^0;		//热键1
sbit hot2 = P1^1;		//热键2
sbit hot3 = P1^2;		//热键3
sbit hot4 = P1^3;		//热键4
sbit hot5 = P1^4;		//热键5
sbit hot6 = P1^5;		//热键6
sbit hot7 = P1^6;		//热键7
sbit hot8 = P1^7;		//热键8


/*
**********************************************************************
*                         函数原型声明
**********************************************************************
*/
int control_key_scan(void);
int hot_key_scan(u16 flag);
void delay10ms(void);

/*
**********************************************************************
*  函数名：control_key_scan
*  作用：控制按键扫描
*  返回：被按下的按键值，如果没有按键按下返回0
**********************************************************************
*/
int control_key_scan(void)
{
	if( key1 == 0 )
	{
		delay10ms();
		if ( key1 == 0 )
		{
			return 1;
		}
	}

	if( key2 == 0 )
	{
		delay10ms();
		if ( key2 == 0 )
		{
			return 2;
		}
	}

	if( key3 == 0 )
	{
		delay10ms();
		if ( key3 == 0 )
		{
			return 3;
		}
	}

	if( key4 == 0 )
	{
		delay10ms();
		if ( key4 == 0 )
		{
			return 4;
		}
	}

	return 0;
}



/*
**********************************************************************
*  函数名：hot_key_scan
*  作用：8路热键扫描
*  返回：被按下的按键值，如果没有按键按下返回0
**********************************************************************
*/
int hot_key_scan(u16 flag_hot_scan)
{	
	if(flag_hot_scan==0) return 0;
	if( hot1 == 0 )
	{
		delay10ms();
		if ( hot1 == 0 )
		{
			return 1;
		}
	}

	if( hot2 == 0 )
	{
		delay10ms();
		if ( hot2 == 0 )
		{
			return 2;
		}
	}

	if( hot3 == 0 )
	{
		delay10ms();
		if ( hot3 == 0 )
		{
			return 3;
		}
	}

	if( hot4 == 0 )
	{
		delay10ms();
		if ( hot4 == 0 )
		{
			return 4;
		}
	}

	if( hot5 == 0 )
	{
		delay10ms();
		if ( hot5 == 0 )
		{
			return 5;
		}
	}

	if( hot6 == 0 )
	{
		delay10ms();
		if ( hot6 == 0 )
		{
			return 6;
		}
	}

	if( hot7 == 0 )
	{
		delay10ms();
		if ( hot7 == 0 )
		{
			return 7;
		}
	}

	if( hot8 == 0 )
	{
		delay10ms();
		if ( hot8 == 0 )
		{
			return 8;
		}
	}

	return 0;
}



/*
**********************************************************************
*  函数名：delay10ms
*  作用：等待10ms
*  返回：无
**********************************************************************
*/
void delay10ms(void)   //误差 0us
{
    unsigned char a,b,c;
    for(c=5;c>0;c--)
        for(b=4;b>0;b--)
            for(a=248;a>0;a--);
}